[
    {
        "id": 1,
        "date": "19 May 2019",
        "title": "Hello and welcome",
        "subtitle": "An introduction and update on my life",
        "author": "Austin Kilduff",
        "body": "<p>Greetings!</p><p>Thanks for taking the time to check out my website. The <a class=\"link-green\" href=\"/\">homepage</a> will serve as a feed of blog-style updates, where you can read about my year in campus ministry.</p><p>I've accepted an offer to serve with the <a class=\"link-green\"href=\"https://ccojubilee.org\">CCO</a> as a campus minister in their Fellowship Program. This means I'll be ministering to students at three schools in Fresno, California (Fresno State, Fresno Pacific University, and Fresno City College) for the next year under the wing of the amazing <a class=\"link-green\" href=\"https://ccojubilee.org/about/our-team/geraud-brumfield/57/\">Geraud Brumfield</a>. Geraud has been serving in partnership with the CCO since 2012 and <a class=\"link-green\" href=\"http://fpcfresno.org\">First Presbyterian Church</a> since 2017.</p><img class=\"img-fluid\" src=\"/static/img/post-1-fresnoshirt.jpg\"><p>I'm really excited for where God has led me up to this point and where He is now inviting me to share the Good News of Jesus' coming kingdom with students. Jesus entered my life in college, and I'm looking forward to connecting students with the body of Christ and seeing the radical transformation of the Gospel in their lives.</p><p>Please take a moment to <a class=\"link-green\" href=\"/about\">read more about my work</a>, <a class=\"link-green\" href=\"/about#contact\">get in touch with me</a>, or <a class=\"link-green\" href=\"/donate\">consider supporting me</a> financially and in prayer. As the <a class=\"link-green\" href=\"https://bcponline.org/DailyOffice/compline.html\">Book of Common Prayer</a> states, \"our common life depends upon each other's toil,\" and I hope we can join in supplying each other's needs to glorify Him.</p><p>Thanks again for stopping by! \"Now may the Lord of peace himself give you peace at all times in every way. The Lord be with you all.\" (2 Thessalonians 3:16)</p>"
    },
    {
        "id": 2,
        "date": "2 June 2019",
        "title": "Learn more about my ministry",
        "subtitle": "Would you like to be a part of God's work too?",
        "author": "Austin Kilduff",
        "body": "<p>For the first few years of my life, I attended church with my family with some regularity, but the Bible stories I heard fell on deaf ears. Any Christian exposure I received early in life fell on rocky soil, and by age nine or ten I had self-applied the term \"atheist.\" In high school and college I coasted along, trying to find life and fulfillment in almost anything I could. I ended up exhausted, emotionally disoriented, and I didn't know where to turn.</p><p>From listening to stories from friends and campus ministry staff with the CCO (Coalition for Christian Outreach), I've heard that far too often this is the story of many college students. Pew Research noted that \"The fastest growing religion in the U.S. is atheist, agnostic or nothing in particular,\" and in 2016 The American College Health Association found that \"53% of students feel hopeless.\" The college campus is a critical mission field.</p><p>I've been in the shoes of an unbelieving college student, far from God and trapped in a web of self-interest, and I've been the beneficiary of God's grace that delivered me from lifelessness. Thankfully, once I was emptied out, God was ready to fill me. I began to read the Bible and turned to church, where I was discipled and even encouraged to minister to others.</p><p>But what about the many students who do not yet have a Christian community encouraging them, or those who still lack hope and are struggling without a vision for their lives?</p><p>I feel a great burden for these students, and sense God's call to minister to them. I'm excited to share that I recently accepted a campus ministry position with the CCO at Fresno State University, Fresno Pacific University, and Fresno City College where I will partner with a CCO veteran, Geraud, and a local congregation to invite students into a relationship with the One who loves them unconditionally.</p><p>I'm also excited to share my testimony with \"so great a cloud of witnesses\" (Hebrews 12:1) and to turn to you for support. I'm trusting God for my full support of $2000 each month to reach students with the Gospel. If you share my burden for young people, perhaps you will partner with me in this ministry through your prayers and financial support. Giving information is included.</p><p>I'm so grateful for you. I look forward to sharing stories of what God is doing in students' lives!</p><a class=\"button btn btn-primary btn-right\" href=\"https://ccojubilee.org/akilduff\">Donate</a>"
    },
    {
        "id": 3,
        "date": "13 August 2019",
        "title": "God has been faithful in Fresno!",
        "subtitle": "Finishing training & arriving in Fresno",
        "author": "Austin Kilduff",
        "body": "<img class=\"img-fluid\" src=\"/static/img/post-3-praying.jpg\"><p><em>Unless the Lord builds the house, those who build it labor in vain.</em></p><p><em><b>-Psalm 127</b></em></p><hr><h3 class=\"heading-green\">New Staff Training Complete!</h3><p><b>My summer of campus ministry training with the CCO equipped me</b> for leading Bible studies, evangelism, discipleship and serving in a church partnership. I grew close to my fellow new CCO staff, and I met many amazing veteran CCO staff as well at Summer Institute, one of the CCO's all-staff training events.</p><p>Our final day together was bittersweet - <b>a time of prayer and commissioning before heading to the mission field of the college campus.</b></p><hr><h3 class=\"heading-green\">Arrival in Fresno</h3><p>The next morning, my colleague Geraud and I flew from Pittsburgh to Fresno, stepping out of the airport into the high-90s midday heat. I was carrying enough books in my backpack to stock a respectably-sized personal library, and I knew I'd soon be living with a family I had never met, in a city I had never visited. I had many reasons to feel less than enthused, but <b>I couldn't help but grin with excitement.</b> The reality of serving God with the CCO in a far-off place was finally setting in.</p><img class=\"img-fluid\" src=\"/static/img/post-3-teaching.jpg\"><em class=\"caption\">Teaching about vocation at Encounter Fresno</em><p>Immediately I got involved with Encounter Fresno, a new CCO Summer Opportunity that allows students from across the country to intentionally live together in the city while deepening in understanding of the Gospel, learning from members of the local church, and developing a vision for their studies through work experience. I had the honor of teaching a class alongside Geraud about vocation. We asked the students to create a diagram of how their interests or majors relate to the Gospel narrative of Creation, Fall, Redemption, and Restoration, and <b>were amazed at their thoughtful and enthusiastic reflections.</b> From sociology, speech pathology, and entrepreneurship to construction management and humor, these students were already beginning to see how their passions and studies are under the Lordship of God and will be utilized in the Kingdom.</p><img class=\"img-fluid\" src=\"/static/img/post-3-encounter.jpg\"><em class=\"caption\">Encounter Fresno students share their reflections</em><hr><p>Thank you for your interest, care, prayers and support! As the fall semester approaches, <b>would you please continue to pray for the ministry in Fresno?</b> Here are some thanksgivings and prayer requests:</p><h5>Thanksgivings:</h5><ul><li>God's provision of housing and a car</li><li>The opportunity to work with Encounter Fresno students before the semester starts</li></ul><h5>Prayer Requests:</h5><ul><li>That I will develop meaningful relationships on campus</li><li>That the students at Fresno State University, Fresno Pacific University, and Fresno City College will deepen in faith</li><li>That I will find mentors in the church to guide my spiritual growth</li></ul><a class=\"button btn btn-primary btn-right\" href=\"https://ccojubilee.org/akilduff\">Donate</a>"
    },
    {
        "id": 4,
        "date": "17 October 2019",
        "title": "Read Kim's story!",
        "subtitle": "A student's story and some updates",
        "author": "Austin Kilduff",
        "body": "<img class=\"img-fluid\" src=\"/static/img/post-4-city.jpg\"><p><em>Iron sharpens iron, and one man sharpens another.</em></p><p><em><b>-Proverbs 19</b></em></p><p>Your prayers and financial support are making such a difference in the lives of students we serve. Thank you for partnering with me in this important mission!</p><hr><h3 class=\"heading-green\">A Twin Named Kim</h3><p>One day while doing table outreach at Fresno State, a curious student approached our table to investigate our prize wheel and colorful display of snacks, games, and school supplies. Geraud and I introduced ourselves and asked the standard questions - we learned her name is Kim, she's a senior studying psychology, and she just transferred. After talking for a few minutes, Geraud told her \"hopefully we'll see you around.\" Kim replied, \"unless you get me confused with my secret twin sister.\" Intrigued, we inquired further. Kim told us she once visited family in Mexico and ran into a girl who looked exactly like her. Her mother had hidden this fact so far, but now the cat was out of the bag and at long last Kim met her twin. <b>Geraud and I were stunned</b> by this Parent Trap-esque story and remained in awe long after Kim said goodbye and went to class.</p><p>A few weeks later we were in the same spot to meet students. Not long after setting up, I saw a familiar face approaching and immediately remembered her incredible story. Kim walked up and said hello, but my memory was failing me. \"Hello! I remember the story about your sister... but not your name.\" A small smile appeared on her face as she realized she could give me a hard time. \"Wow, you forgot all about me!\" I began to apologize when her smile turned into a giggle. I breathed a sigh of relief that she was being a good sport, and Kim finally reminded me of her name. She spun the prize wheel and won a free lunch with Geraud or I. Some students aren't interested in meeting up with someone they just met, so we give them the option to spin again. <b>Kim, however, got excited.</b> \"It'll be payback for forgetting everything about me.\"</p><p>When Kim and I got lunch the following Monday, I invited her to a few upcoming events including our weekly Bible study. \"Aw, I have a conflict Monday nights. But I might be able to come afterwards tonight.\" When students say maybe, it usually means no. But once again, <b>Kim proved to be the exception</b> when she showed up in the library to meet the group after our Bible study had ended. And the next week. And every Monday night since. Now when Geraud and I are on campus to meet students, <b>Kim is at our side</b> enthusiastically inviting her fellow students to \"Come spin the wheel and win a prize!\"</p><p>Kim has some church background, but is still in the beginning stages of understanding the Gospel and getting integrated with a Christian community. However, <b>our relationship with Kim has gotten off to an incredible start</b> and we're so encouraged to see her continue to show up and connect with other students. I ask that you would <b>join me in praying for Kim</b>, that she will come to experience Jesus in impactful ways and that her continued presence in and enthusiasm for the group will spread and build greater unity in our community of students.</p><img class=\"img-fluid\" src=\"/static/img/post-4-state.jpg\"><em class=\"caption\">Kim, second from the right, joining us while tabling at Fresno State</em><hr><h3 class=\"heading-green\">Upcoming Events & Prayer Requests</h3><p>I'm excited to announce a couple of upcoming events for our students and opportunities for myself. First, <b>Geraud and I will be taking our students on a Fall Retreat</b> from November 1-3 at a cabin in the Sierra Nevada mountains. The retreat will center around <b>hearing from God</b> and will include Bible study, spiritual disciplines, group discussions, and time alone to practice being present with God. I would appreciate prayers that many students will be able to attend, and that those who attend will <b>grow deeper in relationship with the Father, Son, and Spirit.</b></p><p>Shortly after the retreat, I will be traveling to Memphis for a CCO professional development opportunity, the Memphis Freedom Tour. The purpose of this trip is to better understand the past, present, and future of the battle for civil rights in America while also learning to <b>embrace God's multiethnic kingdom</b> in my life and ministry. Finally, a few weeks later I will join my cohort of CCO Fellows on a paddling and camping trip in Georgia to <b>reflect on my experiences in campus ministry and discern my future with the CCO.</b></p><p>For both of these trips, I would appreciate prayers for my spiritual and professional growth. I'm also seeking your partnership in raising financial support to participate in the Memphis Freedom Tour. In addition to my monthly goal of $2000, I'm hoping to raise $350 for the cost of the trip and $500 for the cost of flights. <b>Would you please prayerfully consider a donation to help me better engage all students with the Gospel?</b></p><hr><h3 class=\"heading-green\">Kodak Moments</h3><img class=\"img-fluid\" src=\"/static/img/post-4-escape.jpg\"><em class=\"caption\">Student Leadership Team takes the W at Fresno Escape Room</em><img class=\"img-fluid\" src=\"/static/img/post-4-ampersand.jpg\"><em class=\"caption\">Group outing at Ampersand Ice Cream</em><img class=\"img-fluid\" src=\"/static/img/post-4-ghostgolf.jpg\"><em class=\"caption\">Haunted house + mini golf = Ghost Golf</em><img class=\"img-fluid\" src=\"/static/img/post-4-biblestudy.jpg\"><em class=\"caption\">Bible Study at Fresno State library</em><img class=\"img-fluid\" src=\"/static/img/post-4-headsup.jpg\"><em class=\"caption\">Act it Out: \"Opening Window Blinds\"</em><a class=\"button btn btn-primary btn-right\" href=\"https://ccojubilee.org/akilduff\">Donate</a>"
    },
    {
        "id": 5,
        "date": "18 November 2019",
        "title": "A reflection from Memphis Freedom Tour",
        "subtitle": "How the National Civil Rights Museum stunned me",
        "author": "Austin Kilduff",
        "body": "<img class=\"img-fluid\" src=\"/static/img/post-5-praying.jpg\"><p>It was late on Friday morning and we had been walking through the National Civil Rights Museum for around 90 minutes. Beginning with an exhibit on the commodification of black lives in early America and continuing through white America's desperate cling to segregation during the civil rights movement, the morning had been tense and emotionally exhausting.</p><p>As we entered another room, I looked around at my fellow staff members. Everyone was wearing the grief of the day's experience on their faces, some in downturned mouths and furrowed eyebrows, others in tears, sniffles, and sighs. I'm sure my face displayed the shame, anger, and despair I felt throughout my body as well.</p><p>I walked in further. A video was playing on the back wall of the room. Before I even laid eyes on the screen, I heard the unmistakable voice of Martin Luther King Jr. and soon recognized the video as his famous \"I Have a Dream\" speech. I've heard and read parts of this speech probably a dozen times before in history classes and documentaries, but one part in particular was sticking out to me this morning - \"I have a dream that one day every valley shall be exalted, and every hill and mountain shall be made low, the rough places will be made plain, and the crooked places will be made straight; and the glory of the Lord shall be revealed and all flesh shall see it together.\"</p><p>After hearing the first few words in this allusion to Isaiah, I felt goosebumps tingling on my arms and legs. I stood with eyes transfixed on the black and white image of Dr. King, ears eager to hear more. With each additional word, chills ran down my spine. This speech and Isaiah 40 and the themes of Revelation 7 were nothing new to me, but through the confluence of these words amidst the hopelessness and frustration I was feeling, God was speaking words of living hope to me just as He spoke to Martin Luther King more than 50 years ago.</p><p>My heart still aches over the long but continuing history of racist dehumanization in this country. I don't suspect systematic discrimination nor my heartache will be solved anytime soon. But my soul feels refreshed knowing that just as Jesus trudged through misery toward the future His Father revealed to Him, so did Dr. King and so can I.</p>"
    },
    {
        "id": 6,
        "date": "19 November 2019",
        "title": "Make a difference for students on Giving Tuesday!",
        "subtitle": "Only two weeks until the year's biggest giving day",
        "author": "Austin Kilduff",
        "body": "<img class=\"img-fluid\" src=\"/static/img/post-6-givingtuesday.jpg\"><h3 class=\"heading-green\">What is Giving Tuesday?</h3><p>Giving Tuesday is celebrated on the Tuesday following Thanksgiving to recognize and support non-profit organizations. This year, it falls on <b>December 3rd</b> - only 2 weeks away!</p><p>At the CCO we believe faithfulness is pursued together, and that means <b>you play an important part in transforming students' lives.</b> We are embracing Giving Tuesday as an opportunity to invite you to join our mission - that every student needs to hear the <b>Gospel,</b> connect to a local <b>church,</b> and gain a <b>vision</b> for serving Christ in the world.</p><img class=\"img-fluid\" src=\"/static/img/post-6-everyone.jpg\"><hr><h3 class=\"heading-green\">How you can help</h3><p>Thanks to my supporters, I've already received over 75% of my funding goal for this fiscal year! Now it is my goal to secure 100% support by the end of the calendar year. To do this, I need to <b>raise an additional $4800</b> - the equivalent of 8 new supporters at $100 per month. Will you join me?</p><p>You can help by <b>marking your calendar for December 3rd</b> and <b>visiting <a class=\"link-green\" href=\"https://ccojubilee.org/akilduff\">this link</a> on Giving Tuesday</b> to support God's ministry. Your gift will help us reach the 50,000 students in Fresno with the Gospel!</p><img class=\"img-fluid\" src=\"/static/img/post-6-cain.jpg\"><p><b>Jesus works through your generosity to change lives!</b> Watch Clemson CCO student Cain tell his story of getting involved with the church through campus ministry. <a class=\"link-green\" href=\"https://youtu.be/ds8LnKsncbA\">https://youtu.be/ds8LnKsncbA</a></p><a class=\"button btn btn-primary btn-right\" href=\"https://ccojubilee.org/akilduff\">Donate</a>"
    },
    {
        "id": 7,
        "date": "3 December 2019",
        "title": "College students need your help today",
        "subtitle": "You have a stake in bringing the Gospel to students",
        "author": "Austin Kilduff",
        "body": "<img class=\"img-fluid\" src=\"/static/img/post-7-header.png\"><h3 class=\"heading-green\">Giving Tuesday is here!</h3><p>Today is Giving Tuesday - a great opportunity to flex your generosity and give back to the causes you love most.</p><img class=\"img-fluid\" src=\"/static/img/post-7-2percent.png\"><p>Right now only about 2% of college students are being reached by the Gospel. I'm grateful to be on the frontline of this mission, but I can't do it alone. <b>It takes all of us to reach every one.</b></p><p>Do you share in the vision of transforming college students to transform the world?</p><p><b>Join me by contributing towards God's work in Fresno: <a class=\"link-green\" href=\"https://ccojubilee.org/akilduff\">ccojubilee.org/akilduff</a></b></p><img class=\"img-fluid\" src=\"/static/img/post-7-everyone.jpg\"><hr><h3 class=\"heading-green\">The difference you make</h3><p><a class=\"link-green\" href=\"/post/4\">A few months ago I told the story about how Geraud and I met a student named Kim.</a> Since October, Kim has been coming to church on Sundays and meeting with me Fridays to hang out, talk about life, and read the Gospel of John. <b>It's thanks to the gifts my supporters provide that Kim is hearing the Gospel twice a week every week.</b></p><img class=\"img-fluid\" src=\"/static/img/post-7-spikeball.jpg\"><em class=\"caption\">Playing lawn games with Kim and some fellow Fresno State students</em><hr><h3 class=\"heading-green\">How to give</h3><p>I'm still looking to close the $4800 gap in my fundraising goal for this year. If you'd like to help me reach college students, <b>you can give online by visting <a class=\"link-green\" href=\"https://ccojubilee.org/akilduff\">ccojubilee.org/akilduff</a></b> and making either a monthly or one-time donation.</p><p>By contributing to CCO ministry in Fresno, <b>you are allowing more students to hear the good news about Jesus.</b> Students like Kim, who are now learning through the Gospel what it means to transform the world. This is a powerful opportunity - <b>will you prayerfully consider if God is calling you to help fuel this mission?</b></p><a class=\"button btn btn-primary btn-right\" href=\"https://ccojubilee.org/akilduff\">Donate</a>"
    },
    {
        "id": 8,
        "date": "10 December 2019",
        "title": "Jill is being transformed by your love and charity",
        "subtitle": "This semester has been marked by transformation - help that continue",
        "author": "Austin Kilduff",
        "body": "<img class=\"img-fluid\" src=\"/static/img/post-8-crossings.jpg\"><p><em>\"But who am I, and what is my people, that we should be able thus to offer willingly? For all things come from you, and of your own have we given you.\"</em></p><p><em><b>-1 Chronicles 29:14</b></em></p><hr><h3 class=\"heading-green\">How are things going in California?</h3><p>Without fail, I get asked this question when I'm catching up with folks. My instinctive reply is \"good...\" followed by a brief pause. In that time I think about the many things that have made this past semester <em>good</em> - a church committed to mission in Fresno, the natural beauty of the Central Valley's national parks, personal & professional growth, and, of course, <b>the amazing students I've served.</b></p> <p>- I think of Matt, who is now using his beloved vocation of music to direct the choir at church.</p><p>- I think of Jackson, who amidst the stress of his first semester of college and busyness of working nights and weekends, has eagerly embraced our discipleship time as a joyful retreat to decompress and receive prayer.</p><p>- And I think of Jill, who, although experiencing a turbulent period of transition in several areas of her life, <b>displays an appetite to know Jesus through discipleship and community</b> that bears clear witness to the power of the Spirit working in her.</p><p>Reflecting on the last few months, Jill said:</p><p class=\"box\">\"After years of trying to strengthen my faith by myself, it feels as if I have finally found the missing piece to the puzzle. Becoming involved with a growing community of like-minded and faith-based students my age has opened the door to a <b>spiritual joy</b> I have never been able to capture unassisted. Through just a few months of active involvement in a group as discipleship-based as the CCO, I can say with certainty that <b>my faith has far surpassed what I dreamed was possible.</b> I now know that if I have a group by my side that lifts my burdens with me and never fails to point me back to the love of Christ, <b>I will not be defeated in life's struggles.</b> Experiencing community through the leadership of believers such as Austin and Geraud and the fellowship of students just like myself, <b>I can never rationally go back to walking the path of faith alone.</b>\"</p><p>I wish I could read that paragraph to myself every time someone asks how work is going. My time in California hasn't just been <em>good</em> - <b>it has been <em>deeply transformational for both me and for students.</em></b></p><p>Jill is learning to ground her resilience in the <b>Gospel,</b> develop her worldview through the lens of <b>Scripture,</b> exercise her gifts in the body of the <b>church,</b> and pursue her interests for the <b>glory of God.</b> I don't know many 19-year-olds who would want to inaugurate a group study on RC Sproul's <em>What is Reformed Theology?</em> or plan a series of paintings creatively capturing the imagery of the book of Revelation, but <b>Jill isn't most 19-year-olds.</b></p><p>This is why we invest in college students - campuses are filled with creative, capable, willing servants, who need others to help them gain a bigger vision for their lives. You and I are part of exciting and important work for the Kingdom!</p><img class=\"img-fluid\" src=\"/static/img/post-8-group.jpg\"><em class=\"caption\">Jill, second from left, with the First Pres college group</em><hr><h3 class=\"heading-green\">Ubi caritas et amor, Deus ibi est</h3><p>\"Where charity and love are, there God is.\"</p><p>My work with students like Matt, Jackson and Jill <b>depends on the charity and love of supporters like you,</b> for that is where God is working. Thank you for praying and for investing in this work -- especially in the last couple of weeks around Giving Tuesday. I'm now about $1000 closer to my goal of being fully-funded by the end of the year! </p><p>If you share a desire for college students to experience transformation, <b>would you offer a charitable gift toward the last $3800 of my support raising goal?</b> You can help by <b>committing to monthly support</b> or <b>making a special year-end donation</b> at <b><a class=\"link-green\" href=\"https://ccojubilee.org/akilduff\">ccojubilee.org/akilduff</a>.</b></p><p>As a postscript, I'll be in Boston until December 16th, then Pittsburgh until December 20th, and finally Canton until January 6th. If you're in one of these places and would like to meet up to hang out and/or hear more about our vision to reach EVERY student and how you can help, please reach out!</p><a class=\"button btn btn-primary btn-right\" href=\"https://ccojubilee.org/akilduff\">Donate</a>"
    },
    {
        "id": 9,
        "date": "11 February 2020",
        "title": "Jubilee is coming! Help Fresno students explore God's call on their lives",
        "subtitle": "Sixteen Fresno students are going to this conference to grow in Christ together",
        "author": "Austin Kilduff",
        "body": "<img class=\"img-fluid\" src=\"/static/img/post-9-jubilee.jpg\"><em class=\"caption\">CCO Boston at Jubilee 2019</em><hr><p>Early on a Friday morning last February, I packed into the back of a twelve-passenger van to embark on a ten-hour journey from Boston to Pittsburgh. The college and young adult group at Church of the Cross was headed for Jubilee, the CCO's annual conference that gathers thousands of college students to explore God's role in our studies, careers, and every other area of life.</p><p>It was at Jubilee that I learned about the Fellowship Program and met Geraud, who would end up becoming my mentor. <b>I can point to this single weekend in Pittsburgh as the time I heard about new possibilities for the direction of my career, met the people who would help me realize God's call on my life, and began to receive the prayer and support I needed to move forward.</b></p><hr><p>Next Wednesday, Geraud and I are bringing <b>16 students</b> to Jubilee 2020! Some of the students have been part of our church for most of their lives, some have never been. Some go to Fresno State or Clovis Community, others Fresno City or Fresno Pacific. Others are taking gap years or have graduated from high school and are trying to decide if college is right for them. <b>We are blessed to have such a varied group and excited that Jubilee can offer something to each one.</b></p>Jubilee helped me see how Jesus wanted to mold and utilize my life, and I'm praying that the same will happen for <b>Jackson, Mariah, Jill, Cristobal, Morgan, Adam, Anyssa, Mary Ann, Matt, Emily, Katie, JR, Bri, Michaela, Chris, and Sara</b> this year.<p>Since the Fresno group will be flying cross-country to attend the conference, Geraud, the students, and I are looking to <b>raise an additional $3500</b> to help offset airfare & registration costs. <b>Will you pray with me for the sixteen students named above, and ask if God is calling you to financially support this trip?</b> If so, please visit <a class=\"link-green\" href=\"https://give.ccojubilee.org/fresno2020\">give.ccojubilee.org/fresno2020</a> to contribute!</p><a class=\"button btn btn-primary btn-right\" href=\"https://give.ccojubilee.org/fresno2020\">Donate</a>"
    },
    {
        "id": 10,
        "date": "7 April 2020",
        "title": "A summary from Jubilee 2020",
        "subtitle": "How sixteen Fresno students saw God at work in Pittsburgh",
        "author": "Austin Kilduff",
        "body": "<img class=\"img-fluid\" src=\"/static/img/post-10-pittsburgh.jpg\"><p>Every February, the Coalition for Christian Outreach (CCO) holds its annual Jubilee conference in Pittsburgh, Pennsylvania, hosting thousands of college students from around the country. The weekend-long conference features four keynote speakers who discuss the Gospel narrative through Creation, Fall, Redemption, and Restoration. Jubilee also provides students with dozens of workshops, corporate worship, community group discussions, a concert (new addition this year), exhibitors from various Christian organizations, and a full-fledged bookstore. It is at Jubilee that the CCO's mission, \"Transforming college students to transform the world,\" is most prominently on display. The opportunity is made available for students to shape their worldviews in response to Jesus and carry the momentum into every aspect of their lives, especially their studies and careers.</p><p>This year, Geraud and Austin, along with Steve & Shiela Skibbie and Audrey Acre, brought sixteen students to Jubilee. This group represents a wide variety of backgrounds - some attend First Pres every Sunday, other have never been; some are between high school and college, some graduated, some in the middle, and others taking a break from college; some are quite mature in their faith and considering vocational ministry, others taking their first steps toward Jesus; some Geraud and Austin have established strong relationships with, others were invited by friends, or even by friends who were invited by friends.</p><p>In Andy Crouch's Creation talk, he discussed God's gifts of abundance and order which shield us from chaos on the one hand and a machinelink nature on the other. One student reflected, \"I was able to see the big picture. In life we have abundance with work, stress, family contributions, etc., however we need to have order and maintain good time management and know how to deal with it because if not then we will then have chaos with everything going on around us and that can lead us in getting lost along the way.\" Jackie Hill-Perry spoke about the Fall, provoking some students to important questions about God's goodness amidst so much suffering. Another student, hearing Jackie's call to avoid Eve's mistake, said, \"This reminded me that I allow these created things to steal joy away from me by being consumed into them.\" The Redemption session was presented by Dean Weaver, whose focus on different types of \"seeing\" in John 20 gave one student a new vision on her relationship with God and with herself. Of Dean's talk, she said, \"With this experience I have opened up a bit more to knowing what steps I would be taking in order to do more than take a casual look at God.\" Capping off the weekend was David Kinnaman, who related his research on resilient discipleship to God's work of Restoration. One student was able to tie David's discussion of exile in with another book he'd been reading.</p><p>Between the plenary sessions, students had opportunities to attend up to three workshops covering a wide array of topics, including fashion, artificial intelligence, law enforcement, social justice, and many more. One student attended a workshop on evangelism presented by a fellow introvert. Seeing someone like him doing something he wanted to do was a highlight of his weekend. Summarizing the talk, he said, \"Allowing God's love to pour through you into the people you're around, genuine concern for their wellbeing, and the well-meaning offer of prayer had worked wonders where thinly-veiled attempts at evangelising met resistance and failure.\" Another student, who attended workshops on vocational ministry and campus revival, left eager to apply what he learned. \"I am excited to bring these lessons back to my campus and see what God wants to do next.\"</p><p>Also interspersed throughout the weekend were sessions of worship and a cross-cultural dinner and discussion. A particular worship song played transported a student back to her experience at Jubilee last year. Of this, she said, \"Last year, when I recommitted my life, they played this song right after. Singing it this year made me realize how much my life has changed since Jubilee 2019. Last year, I felt very lost and unsure of what I was doing in school, extracurriculars, and more. While I am still learning and progressing, going into the conference this year I was so much more at peace with my life and my faith.\" The cross-cultural dinner, themed \"Hair Love\" after the title of a 2019 short film, gave students of color the space to profess self-love as God created them. The entire Fresno group attended, and one student reflected, \"When we talked about it, it taught me a lot about loving myself and the hair God gave me. It made me realize I should not be ashamed of my hair, even when frizzy and curly, and that it does not need to be perfect in my own eyes because it's perfect in God's.\"</p><p>In the three years First Pres has sent a group to Jubilee, this year saw the greatest number of students. All sixteen left Pittsburgh with a great appreciation for the opportunity and hearts oriented toward the Lord. Here are just some of the many additional quotes from students:</p><p class=\"box\">\"Hearing other stories really made me feel like I was not alone. Jubilee is a great chance to find out who you really are and surround yourself with like minded people.\"</p><p class=\"box\">\"Jubilee gave me a better understanding of what it looks like for me to trust God in my unbelief.\"</p><p class=\"box\">\"What struck me was the very intentional application of their tag line \"Every Thing Matters\" to, quite literally, every thing.\"</p><p class=\"box\">\"I'm really thankful for this wonderful experience and hopefully be able to do it again next year.\"</p><p>We are extremely grateful for God's work in and through each of these students, and for the continued prayers and support of First Pres that made Jubile possible this year. We look forward to watching these students continue to grow in Christ and hope many will be able to attend Jubilee 2021!</p><img class=\"img-fluid\" src=\"/static/img/post-10-conference.jpg\">"
    },
    {
        "id": 11,
        "date": "28 April 2020",
        "title": "Ministry continues in Fresno",
        "subtitle": "Post-Jubilee momentum has been carrying us through COVID",
        "author": "Austin Kilduff",
        "body": "<img class=\"img-fluid\" src=\"/static/img/post-11-largegroup.jpg\"><p><em>Increase, O God, the spirit of neighborliness among us, that in peril we may uphold one another, in suffering tend to one another, and in homelessness, loneliness, or exile befriend one another. Grant us brave and enduring hearts that we may strengthen one another, until the disciplines and testing of these days are ended, and you again give peace in our time; through Jesus Christ our Lord. Amen.</em></p><p><em><b>-Prayer in times of social conflict or distress, ACNA Book of Common Prayer</b></em></p><hr><h3 class=\"heading-green\">CCO Fresno's New Normal</h3><p>I was still feeling invigorated from Jubilee a few weeks earlier; sixteen students with sixteen unique experiences, all of them encouraging. Spring break would begin in a few weeks, and I was particularly excited for our plan to spend a week near Mount Shasta in Northern California to help a town rebuild after a wildfire. In the meantime, I was taking the first steps toward a goal I'd had to start a tabletop gaming ministry with some students I'd met at Fresno City College. This was mid-March, and <b>I was finally settling into a groove.</b></p><p>After the first couple of cases of COVID appeared in Fresno, I met with some student leaders on a rainy Monday evening. In addition to spring break, we also had about a dozen other events planned for the rest of the semester. We decided to put those on hold, but maybe keep some small in-person gatherings. By Thursday, the city of Fresno issued a shelter-in-place order. The next day, so did the state of California. <b>All our plans were thrown out the window.</b></p><p>It was disappointing and frustrating for me to see such wonderful plans dissipate. The students were feeling much the same. <b>It was evident that God had a different plan,</b> however, so we decided to embrace the change. Some things have remained the same - we still have Bible study on Thursday nights and Geraud & I still meet with students one-on-one (all through video-call, of course). <b>But we've also taken the opportunity to augment our ministry.</b> We've added a Sunday hangout, Monday game night, and Wednesday mid-day prayer to our weekly schedule.</p><img class=\"img-fluid\" src=\"/static/img/post-11-gamenight.jpg\"><em class=\"caption\">Game night on Houseparty app</em><p>Change such as this often elicits a fight-or-flight response. Some students have drawn back, but many others have pressed in. One such student, <b>Morgan, has been on fire since Jubilee.</b> Before moving to Fresno in October, Morgan was wary of the church. Through her brother she found First Pres, got involved with our college group, and began opening up to the idea of community. <b>Morgan has always been engaging and inquisitive, but especially so after Jubilee.</b> She left the conference reflecting, \"I guess my perspective regarding God is still that of many questions. But I also see now more than ever how merciful he really is and just as much as we should want him, he wants us!\" She began vocalizing these questions, prompting hours of great discussion. Additionally, Morgan reflected:</p><p class=\"box\">\"I want to live a life more pleasing to God, I want to be able to keep my promises to him just as he does with me. I want to have more discipline in my daily life to fill my desperation for the Lord. I need to commit to him in all areas of my life and not just when I feel like it. He is constantly choosing me, and it amazes me that he does so without asking much from me but to love him and give him praise.\"</p><p>Thankfully, by God's grace, Morgan's momentum has only picked up since quarantine began. She has embraced our virtual college group hangouts, sought out opportunities to pray and read at home everyday, and continued asking questions about how Jesus is calling her to serve Him. <b>And the spiritual benefits of her devotion are evident.</b> The first time Morgan and I met, she related some experiences she's had with God and expressed a desire to commune with Him more. <b>Through involvement with the church and regular spiritual disciplines, Morgan's sense of God's presence in her life has indeed increased in spite of social distancing.</b></p><p>Thank you to everyone who has prayed for the students in our ministry, especially surrounding Jubilee and distance ministry. If you're interested in learning more about CCO Fresno's time at Jubilee, <a class=\"link-green\" href=\"/post/10\">you can read a summary I wrote up here.</a></p><img class=\"img-fluid\" src=\"/static/img/post-11-smallgroup.jpg\"><em class=\"caption\">Morgan, second from the right, in Pittsburgh for Jubilee</em><hr><h3 class=\"heading-green\">Prayer Requests</h3><ul><li>Please pray for students who are lamenting a disrupted semester, particularly seniors.</li><li>Please pray that the students who have withdrawn during quarantine will become more involved.</li><li>God willing, I'll be returning to Boston in June to continue working with the CCO part-time.<ul><li>Please pray that this position will be finalized.</li><li>Please pray that I will find other part-time work.</li><li>Please pray that I will find suitable housing in Boston.</li></ul></li></ul><a class=\"button btn btn-primary btn-right\" href=\"https://ccojubilee.org/akilduff\">Donate</a>"
    },
    {
        "id": 12,
        "date": "2 June 2020",
        "title": "What's next in my ministry",
        "subtitle": "Continuing CCO ministry in a familiar place",
        "author": "Austin Kilduff",
        "body": "<img class=\"img-fluid\" src=\"/static/img/post-12-boston.jpg\"><p><em>For the ministry of this service is not only supplying the needs of the saints but is also overflowing in many thanksgivings to God.</em></p><p><em><b>-2 Corinthians 9:12</b></em></p><hr><h3 class=\"heading-green\">It's official!</h3><p>After several months of considering my options, praying for discernment, and finally discussing logistics, the paperwork is now in for me to continue campus ministry with the CCO. <b>This year I'll be returning to Boston</b> and my home church, Church of the Cross, to minister to students primarily at my alma mater, Northeastern University, and the nearby Wentworth Institute of Technology. <b>Every piece of this position reveals such a great fit.</b> I'm familiar with and have great love for Boston, Church of the Cross, and Northeastern, and I'm hoping my experience as a STEM student will help me minister more personally to students at Wentworth.</p><hr><h3 class=\"heading-green\">I need your help</h3><p>This past year, my salary depended on raising a bit more than $1600 per month, and I saw God mobilize my friends and family to help equip me for this mission. For ministry in Boston, my goal has increased to $2400 per month. This increase accounts for several factors, including salary increase from Fellow to \"career staff\" and cost of living in Boston.</p><p><a class=\"link-green\" href=\"https://akilduff.com\">I invite you to read through some of the stories of real students I've had the pleasure of discipling over the last year.</a> <b>These are students who have been given the opportunity to step further into relation with Jesus through the partnership of my supporters.</b></p><ul><li>If you are already supporting this ministry through automatic giving, good news! Nothing is required on your end to keep giving.</li><li>If you wish to increase your automatic gifts, get in touch with me and I'll help you set that up.</li><li>If you have supported me in the past through individual gifts, please consider either signing up for automatic gifts or making another contribution.</li><li>If you haven't yet given, now is the perfect time to help me jump-start this next step in my journey and make a difference for college students.</li></ul><p>Online donations can be given at <a class=\"link-green\" href=\"https://ccojubilee.org/akilduff\">ccojubilee.org/akilduff.</a> You can also mail cash or a check made out to the CCO with \"Austin Kilduff\" in the memo line to:</p><p>CCO, 5912 Penn Avenue<br>Pittsburgh, PA 15026</p><hr><h3 class=\"heading-green\">Prayer requests</h3><ul><li>I'm still searching for housing in Boston, now targeting a July 1st move-in date. Please pray for God to place me in community with other Christians.</li><li>At this moment, Northeastern and Wentworth are planning on returning to campus for the fall semester. Please pray that the fight against COVID allows this.</li><li>If the situation doesn't improve, please pray that I will find creative ways to reach out to new students not in-person.</li><li>CCO Fresno is getting a new Fellow! Please pray for her upcoming year and for the students I discipled this past year.</li></ul><img class=\"img-fluid\" src=\"/static/img/post-12-prayer.png\"><em class=\"caption\">Receiving prayer during my final First Presbyterian Church Fresno staff meeting</em><hr><a class=\"button btn btn-primary btn-right\" href=\"https://ccojubilee.org/akilduff\">Donate</a>"
    }
]
